In [1]:
import numpy as np
import pandas as pd

In [2]:
# reading data
dataset = pd.read_csv("Data.csv")

In [3]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
for col in dataset.columns:
    print(col, dataset[col].isnull().sum())

Country 0
Age 1
Salary 1
Purchased 0

In [5]:
dataset = dataset.dropna()
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
country = dataset["Country"]
purchased = dataset["Purchased"]

In [7]:
dataset = dataset.drop(["Country"],axis=1)
dataset = dataset.drop(["Purchased"],axis=1)

In [8]:
country_dummies = pd.get_dummies(country)

In [9]:
frames = [dataset, country_dummies]

In [10]:
dataset = pd.concat(frames, axis=1)
dataset

    Age   Salary  France  Germany  Spain
0  44.0  72000.0       1        0      0
1  27.0  48000.0       0        0      1
2  30.0  54000.0       0        1      0
3  38.0  61000.0       0        0      1
5  35.0  58000.0       1        0      0
7  48.0  79000.0       1        0      0
8  50.0  83000.0       0        1      0
9  37.0  67000.0       1        0      0

In [11]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [12]:
purchased = le.fit_transform(purchased)
purchased

array([0, 1, 0, 0, 1, 1, 0, 1])

In [13]:
#iloc[rowstart:rowend, colstart:colend] always in forward direction
x = dataset.iloc[:, :-1].values
y = purchased
# values returns ndarray instead of dataframe (nested list, each nested list is a list)
# [[row1 items], [row2 items]...]

In [14]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=1)

In [15]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()

In [16]:
lr.fit(x_train, y_train)

LogisticRegression()

In [17]:
y_pred = lr.predict(x_test)

In [18]:
y_test, y_pred

(array([1, 0]), array([0, 0]))

In [19]:
from sklearn.metrics import mean_squared_error

In [20]:
mse = mean_squared_error(y_test, y_pred)
mse

0.5